<script setup>
const accordionItems = ref([
  {
    question: 'Фронтенд Разработка:',
    answer: ` Наша команда фронтенд разработки специализируется на создании уникальных и впечатляющих пользовательских интерфейсов. Мы успешно применяем современные фреймворки, такие как Vue.js, React, и Next.js,а также используем TypeScript для обеспечения стабильности и
          масштабируемости наших проектов. Наши разработчики имеют богатый опыт
          в создании динамичных веб-приложений, а также в работе с инструментами
          разработки, включая Vite. Мы стремимся к тому, чтобы интерфейсы,
          разработанные нами, не только соответствовали ожиданиям пользователей,
          но и превосходили их.`
  },
  {
    question: 'Бэкенд Разработка:',
    answer: ` В области бэкенд-разработки наша команда специализируется на создании
          мощных и масштабируемых серверных приложений. Мы владеем экосистемой
          Node.js, Nest.js, PHP, Laravel и Python, что позволяет нам выбирать
          оптимальный стек технологий для каждого проекта. Наши разработчики
          бэкенда имеют опыт в интеграции с различными базами данных, создании
          RESTful API и обеспечении безопасности приложений. Мы стремимся к
          тому, чтобы наши бэкенд-решения были надежными, эффективными и
          соответствовали самым современным стандартам.`
  },
  {
    question: 'DevOps и CI/CD:',
    answer: `  В команде DevOps и CI/CD мы занимаемся интеграцией и автоматизацией
          процессов разработки. Наши специалисты DevOps внедряют передовые
          методы совместной работы, а также эффективно управляют инфраструктурой
          и мониторингом. Мы гордимся нашими навыками в настройке непрерывной
          интеграции (CI) и непрерывной доставки (CD), что обеспечивает быструю
          и надежную поставку продукта. Наша цель - создание эффективной и
          автоматизированной среды разработки, где каждый этап проекта
          выполняется с высоким уровнем профессионализма.`
  },
  {
    question: 'Дизайн и UI/UX:',
    answer: `Наша команда дизайна и пользовательского
          опыта занимается созданием визуально привлекательных и удобных в
          использовании интерфейсов. Мы применяем передовые методы
          UI/UX-дизайна, проводим исследования пользовательских потребностей и
          используем инструменты прототипирования для создания эффективных и
          интуитивно понятных макетов. Наши дизайнеры искусны в работе с
          графическими редакторами, создании адаптивных дизайнов и обеспечении
          единообразия визуального стиля проектов. Мы стремимся не только
          удовлетворить ожидания клиентов, но и создать дизайны, которые
          запоминаются и вдохновляют.`
  }
])
</script>

<template>
  <section class="bg-white dark:bg-gray-900">
    <div
      class="gap-16 items-center py-8 px-4 mx-auto max-w-screen-lg lg:py-16 lg:px-6"
    >
      <div class="font-light text-gray-500 sm:text-lg dark:text-gray-400">
        <h2
          class="mb-4 text-4xl tracking-tight font-extrabold text-gray-900 dark:text-white"
        >
          Цели и задачи:
        </h2>
        <div class="flex flex-col gap-8 w-full">
          <BaseAccordionItem
            v-for="(item, index) in accordionItems"
            :key="index"
            :accordion-item="item"
          />
        </div>
      </div>

      <!-- <div class="grid grid-cols-2 gap-4 mt-8">
        <img
          class="w-full rounded-lg"
          src="https://flowbite.s3.amazonaws.com/blocks/marketing-ui/content/office-long-2.png"
          alt="office content 1"
        />
        <img
          class="mt-4 w-full lg:mt-10 rounded-lg"
          src="https://flowbite.s3.amazonaws.com/blocks/marketing-ui/content/office-long-1.png"
          alt="office content 2"
        />
      </div> -->
    </div>
  </section>
</template>
